# Propiedade DataFrame

DataFrames e Series em pandas compartilham propiedades e métodos com arrays numpy.

exemplo:

shape, size, dtypes, columns, index( retorna linhas), values(retona array)



|Métodos aplicados ao DataFrame| Descrição |
|:-|:-|
|.head(n)| exibe as n primeiras linhas|
|.tail(n)| exibe as n ultimas linhas|
|.to_csv(path/name)| exporta o DF para um arquivo csv (esse método existe para vários outros formatos)|
|.min(axis), .max(axis)| similar aos métodos numpy|
|.cumsum(), mean()| similar aos métodos numpy|
|.value_counts()| retorna a frequencia de determinado valor(aplicar para séries)|
|.sort_values(by=column) |ordena valores|

In [53]:
import pandas as pd
import numpy as np

## Propiedades DataFrame

In [6]:
lista_a =['a', 'b', 'c', 'd', 'a', 'd', 'c']
lista_b = list(range(7))
dic = {'string': lista_a, 'numeros': lista_b}
dic

{'string': ['a', 'b', 'c', 'd', 'a', 'd', 'c'],
 'numeros': [0, 1, 2, 3, 4, 5, 6]}

In [9]:
df = pd.DataFrame(dic)
df

  string  numeros
0      a        0
1      b        1
2      c        2
3      d        3
4      a        4
5      d        5
6      c        6

In [19]:
print(df.size)
print(df.ndim)
print(df.shape)
df.dtypes

14
2
(7, 2)

string     object
numeros     int64
dtype: object

In [20]:
df.columns

Index(['string', 'numeros'], dtype='object')

In [23]:
list(df.columns)

['string', 'numeros']

In [25]:
df.index

RangeIndex(start=0, stop=7, step=1)

## list(df.index)

### Podemos criar um data frame a partir de um array ou um array a partir de um data frame

In [29]:
print(df.values)
print(df.values.shape)
print(type(df.values))

[['a' 0]
 ['b' 1]
 ['c' 2]
 ['d' 3]
 ['a' 4]
 ['d' 5]
 ['c' 6]]
(7, 2)
<class 'numpy.ndarray'>

# Métodos DataFrame

In [38]:
df2 = pd.DataFrame({'coli': np.arange(100)**2,'col2:':np.arange(100)*5})
df2
df2.head(10)
df2.tail()

    coli  col2:
95  9025    475
96  9216    480
97  9409    485
98  9604    490
99  9801    495

In [39]:
df

  string  numeros
0      a        0
1      b        1
2      c        2
3      d        3
4      a        4
5      d        5
6      c        6

In [41]:
df.mean() # faz a análise semantica das colunas as quais colunas possibilitam o retorno da operação.

numeros    3.0
dtype: float64

In [44]:
df.cumsum()

    string  numeros
0        a        0
1       ab        1
2      abc        3
3     abcd        6
4    abcda       10
5   abcdad       15
6  abcdadc       21

In [47]:
df.cumsum()['string']

0          a
1         ab
2        abc
3       abcd
4      abcda
5     abcdad
6    abcdadc
Name: string, dtype: object

In [52]:
df['string'].value_counts()

a    2
c    2
d    2
b    1
Name: string, dtype: int64

In [56]:
df.sort_values(by='string')

  string  numeros
0      a        0
4      a        4
1      b        1
2      c        2
6      c        6
3      d        3
5      d        5